OpenNuvoton/NUC970_U-Boot/arch/arm/include/asm/arch-nuc970/nuc900_cpu.h
/**********************************************************************************************************
 *                                                                          
 * Copyright (c) 2005 - 2013 Winbond Electronics Corp. All rights reserved.      
 *                                                                         
 * FILENAME
 *     nuc900_cpu.h
 *
 * VERSION
 *     1.1
 *
 * DESCRIPTION
 *     This file contains the register map of W90P910 processor. The included H/W Macro functions are
 *     listed below.
 *
 *     0. System Address Map
 *     1. SDRAM Controller
 *     2. Global Controller
 *     3. Clock Controller
 *     4. GPIO
 *     5. Fast Serial Bus
 *     6. Host Bus Interface
 *     7. Flash memory Card Controller (FMI)
 *     8. Audio Interface
 *     9. USB Device
 *    10. LCM
 *    11. Sensor DSP
 *    12. Video Capture Engine
 *    13. JPEG Codec
 *    14. MPEG-4 Video Codec
 *    15. 2-D Graphic Engine
 *    16. Video Processing Engine
 *    17. Motion Estimation Engine
 *    18. High Speed UART
 *    19. UART
 *    20. Timer
 *    21. Interrupt Controller (AIC)
 *    22. Universal Serial Interface
 *    23. External Bus Interface 
 *
 * HISTORY
 *     07/06/2005		 Ver 1.0 Created by PC30 MNCheng
 *
 * REMARK
 *     None
 *     
 **********************************************************************************************************/
#ifndef _NUC900_CPU_H
#define _NUC900_CPU_H

/**********************************************************************************************************
 *                                                               
 * 0. System Address Map - Defines the register base address of each Macro 
 *                         function.
 *
 **********************************************************************************************************/
#define    GCR_BA    0xB0000000 /* Global Control */
#define    CLK_BA    0xB0000200 /* Clock Control */
#define    EBI_BA    0xB0001000 /* EBI Control */
#define    PCI_BA    0xB0002000 /* PCI Control */
#define    EMC_BA    0xB0003000 /* Ethernet MAC */
#define    GDMA_BA   0xB0004000 /* GDMA control */
#define    USBH_BA   0xB0005000 /* USB Host Control */
#define    USBD_BA   0xB0006000 /* USB Device Control */
#define    USBP_BA   0xB0006800 /* USB PHY Control */
#define    DMAC_BA   0xB000C000 /* DMA Control */
#define    FMI_BA    0xB000D000 /* Flash Memory Card Interface */
#define    LCM_BA    0xB0008000 /* Display, LCM Interface & Bypass */
#define    ACTL_BA   0xB0009000 /* Audio Control */
#define    ATA_BA    0xB000A000 /* ATA Interface Control */
#define    GE_BA     0xB000B000 /* 2-D Graphic Engine */

#define    UART0_BA  0xB8000000 /* UART0 Control (console) */
#define    UART1_BA  0xB8000100 /* UART1 Control (Bluetooth) */
#define    UART2_BA  0xB8000200 /* UART2 Control (IrDA) */
#define    UART3_BA  0xB8000300 /* UART3 Control (micro-printer) */
#define    UART4_BA  0xB8000400 /* UART4 Control (console) */
#define    TMR_BA    0xB8001000 /* Timer */
#define    AIC_BA    0xB8002000 /* Interrupt Controller */
#define    GPIO_BA   0xB8003000 /* GPIO Control */
#define    RTC_BA	 0xB8004000 /* Real Time Clock Control */
#define    SC_BA     0xB8005000 /* Smart Card Control */
#define    I2C0_BA   0xB8006000 /* I2C 0 Control */
#define    I2C1_BA   0xB8006100 /* I2C 1 Control */
#define    USI_BA    0xB8006200 /* Synchronous Serial Port */
#define    PWM_BA    0xB8007000 /* Pulse Width Modulation Control */
#define    KPI_BA    0xB8008000 /* Keypad Interface Control */
#define    PS2_BA    0xB8009000 /* PS2 Interface Control */
#define    ADC_BA    0xB800A000 /* ADC Control */

 
 
/**********************************************************************************************************
 *                                                               
 * 1. Global Control Registers  
 *
 **********************************************************************************************************/
#define REG_PDID		(GCR_BA+0x000)    /* Product Identifier Register */
#define REG_PWRON		(GCR_BA+0x004)    /* Power-On Setting Register */
#define REG_ARBCON		(GCR_BA+0x008)    /* Arbitration Control Register */
//#define REG_PINPEC		(GCR_BA+0x00C)    /* Pin Pull-up/down Enable Control Register */
#define REG_MFSEL		(GCR_BA+0x00C)    /* Multiple Function Pin Select Register */



/**********************************************************************************************************
 *                                                               
 * 2. Clock Control Registers  
 *
 **********************************************************************************************************/
#define REG_CLKEN		(CLK_BA + 0x00)    /* Clock Enable Register */
#define REG_CLKSEL		(CLK_BA + 0x04)    /* Clock Select Register */
#define REG_CLKDIV		(CLK_BA + 0x08)    /* Clock Divider Control Register */
#define REG_PLLCON0		(CLK_BA + 0x0C)    /* PLL Control Register 0 */
#define REG_PLLCON1		(CLK_BA + 0x10)	   /* PLL Control Register 1 */
#define REG_PMCON		(CLK_BA + 0x14)	   /* Power Management Control Register */
#define REG_IRQWAKECON	(CLK_BA + 0x18)	   /* IRQ Wakeup Control Register */
#define REG_IRQWAKEFLAG	(CLK_BA + 0x1C)	   /* IRQ Wakeup Flag Register */
#define REG_IPSRST		(CLK_BA + 0x20)    /* IP software reset Register */
#define REG_CLKEN1		(CLK_BA + 0x24)    /* Clock Enable 1 Register */
#define REG_CLKDIV1		(CLK_BA + 0x28)    /* Clock divider control 1 Register */



/**********************************************************************************************************
 *                                                               
 * 3. EBI Control Registers  
 *
 **********************************************************************************************************/
#define REG_EBICON		(EBI_BA + 0x000)    /* EBI control register */
#define REG_ROMCON		(EBI_BA + 0x004)    /* ROM/FLASH control register */
#define REG_SDCONF0		(EBI_BA + 0x008)    /* SDRAM bank 0 configuration register */
#define REG_SDCONF1		(EBI_BA + 0x00C)    /* SDRAM bank 1 configuration register */
#define REG_SDTIME0		(EBI_BA + 0x010)    /* SDRAM bank 0 timing control register */
#define REG_SDTIME1		(EBI_BA + 0x014)    /* SDRAM bank 1 timing control register */
#define REG_EXT0CON		(EBI_BA + 0x018)    /* External I/O 0 control register */
#define REG_EXT1CON		(EBI_BA + 0x01C)    /* External I/O 1 control register */
#define REG_EXT2CON		(EBI_BA + 0x020)    /* External I/O 2 control register */
#define REG_EXT3CON		(EBI_BA + 0x024)    /* External I/O 3 control register */
#define REG_EXT4CON		(EBI_BA + 0x028)    /* External I/O 4 control register */
#define REG_CKSKEW		(EBI_BA + 0x02C)   /* Clock skew control register (for testing) */


/**********************************************************************************************************
 *                                                               
 * 4. GPIO Control Registers  
 *
 **********************************************************************************************************/

/* GPIO Control Registers */
#define REG_GPIOC_DIR		(GPIO_BA+0x04)  /* GPIO portC direction control register */
#define REG_GPIOC_DATAOUT	(GPIO_BA+0x08)  /* GPIO portC data output register */
#define REG_GPIOC_DATAIN	(GPIO_BA+0x0C)  /* GPIO portC data input register */
#define REG_GPIOD_DIR		(GPIO_BA+0x14)  /* GPIO portD direction control register */
#define REG_GPIOD_DATAOUT	(GPIO_BA+0x18)  /* GPIO portD data output register */
#define REG_GPIOD_DATAIN	(GPIO_BA+0x1C)  /* GPIO portD data input register */
#define REG_GPIOE_DIR		(GPIO_BA+0x24)  /* GPIO portE direction control register */
#define REG_GPIOE_DATAOUT	(GPIO_BA+0x28)  /* GPIO portE data output register */
#define REG_GPIOE_DATAIN	(GPIO_BA+0x2C)  /* GPIO portE data input register */
#define REG_GPIOF_DIR		(GPIO_BA+0x34)  /* GPIO portF direction control register */
#define REG_GPIOF_DATAOUT	(GPIO_BA+0x38)  /* GPIO portF data output register */
#define REG_GPIOF_DATAIN	(GPIO_BA+0x3C)  /* GPIO portF data input register */
#define REG_GPIOG_DIR		(GPIO_BA+0x44)  /* GPIO portG direction control register */
#define REG_GPIOG_DATAOUT	(GPIO_BA+0x48)  /* GPIO portG data output register */
#define REG_GPIOG_DATAIN	(GPIO_BA+0x4C)  /* GPIO portG data input register */
#define REG_GPIOH_DBNCE		(GPIO_BA+0x50)  /* GPIO portH input debounce control reg. */
#define REG_GPIOH_DIR		(GPIO_BA+0x54)  /* GPIO portH direction control register */
#define REG_GPIOH_DATAOUT	(GPIO_BA+0x58)  /* GPIO portH data output register */
#define REG_GPIOH_DATAIN	(GPIO_BA+0x5C)  /* GPIO portH data input register */
#define REG_GPIOI_DIR		(GPIO_BA+0x64)  /* GPIO portI direction control register */
#define REG_GPIOI_DATAOUT	(GPIO_BA+0x68)  /* GPIO portI data output register */
#define REG_GPIOI_DATAIN	(GPIO_BA+0x6C)  /* GPIO portI data input register */

/**********************************************************************************************************
 *                                                               
 * 5. Fast Serial Bus Control Registers  
 *
 **********************************************************************************************************/
#define REG_FastSerialBusTrigger		(FSB_BA+0x00)    /* FSB Trigger and SCK Control */
#define REG_FastSerialBusStatus			(FSB_BA+0x04)    /* FSB Status Register */
#define REG_FastSerialBusCR				(FSB_BA+0x08)    /* FSB Control Register */
#define REG_FastSerialBusSCKSDA0		(FSB_BA+0x0C)    /* FSB SCKSDA 0 register */
#define REG_FastSerialBusSCKSDA1		(FSB_BA+0x10)    /* FSB SCKSDA 1 register */
#define REG_SerialBusCR					(FSB_BA+0x14)    /* FSB Software Mode Register */
 
 
/**********************************************************************************************************
 *                                                               
 * 6. Host Bus Interface Control Registers  
 *
 **********************************************************************************************************/
#define REG_HICFCR	(HIC_BA+0x00)		/* HIC function control REGister */
#define REG_HICDAR	(HIC_BA+0x04)		/* HIC software DMA address REGister */
#define REG_HICDLR	(HIC_BA+0x08)		/* HIC software DMA length REGister */
#define REG_HICIER	(HIC_BA+0x0C)		/* HIC interrupt enable REGister */
#define REG_HICISR	(HIC_BA+0x10)		/* HIC interrupt status REGister */
#define REG_HICBIS	(HIC_BA+0x14)		/* HIC BIST REGister */
#define REG_HICCMR	(HIC_BA+0x80)		/* HIC command port REGister */
#define REG_HICPAR	(HIC_BA+0x84)		/* HIC parameter/address port REGister */
#define REG_HICBLR	(HIC_BA+0x88)		/* HIC parameter/burst transfer count REGister */
#define REG_HICDR	(HIC_BA+0x8C)		/* HIC data port REGister */
#define REG_HICSR	(HIC_BA+0x90)		/* HIC status port REGister */
#define REG_HICBUF	(HIC_BA+0x100)		/* HIC internal buffer starting address */
#define _HICBUF_NUM	(64)
 
/**********************************************************************************************************
 *                                                               
 * 7. Flash memory Card Control Registers  
 *
 **********************************************************************************************************/
/* Flash Memory Interface Registers definition */

#define REG_FB0			(DMAC_BA+0x000)	/* Flash buffer 0 ~ 512 */
#define REG_DMACCSR		(DMAC_BA+0x800)	/* DMAC control and status register */
#define REG_DMACSAR1	(DMAC_BA+0x804)	/* DMAC transfer starting address register 1 */
#define REG_DMACSAR2	(DMAC_BA+0x808)	/* DMAC transfer starting address register 2 */
#define REG_DMACBCR		(DMAC_BA+0x80C)	/* DMAC transfer byte count register */
#define REG_DMACIER		(DMAC_BA+0x810)	/* DMAC interrupt enable register */
#define REG_DMACISR		(DMAC_BA+0x814)	/* DMAC interrupt status register */
#define REG_DMACBIST	(DMAC_BA+0x818)	/* DMAC BIST register */


#define REG_FMICSR    (FMI_BA+0x000)   /* FMI control register */
#define REG_FMIIER    (FMI_BA+0x004)   /* FMI interrupt control register */
#define REG_FMIISR    (FMI_BA+0x008)   /* FMI interrupt status register */

