OpenNuvoton/NUC970_U-Boot/arch/arm/include/asm/arch-nuc970/nuc900_cpu.h
/* Secure Digit Registers definition */
#define REG_SDCSR    (FMI_BA+0x020)   /* SD control and status register */
#define REG_SDARG    (FMI_BA+0x024)   /* SD command argument register */
#define REG_SDIER    (FMI_BA+0x028)   /* SD interrupt enable register */
#define REG_SDISR    (FMI_BA+0x02C)   /* SD interrupt status register */
#define REG_SDRSP0   (FMI_BA+0x030)   /* SD receive response token register 0 */
#define REG_SDRSP1   (FMI_BA+0x034)   /* SD receive response token register 1 */
#define REG_SDBLEN   (FMI_BA+0x038)   /* SD block length register */
#define REG_SDTMOUT  (FMI_BA+0x03C)   /* SD response/data-in time out register */
 
/* Memory Stick Registers definition */
#define REG_MSCSR	 (FMI_BA+0x060)   /* MS control and status register */
#define REG_MSIER	 (FMI_BA+0x064)   /* MS interrupt control register */
#define REG_MSISR	 (FMI_BA+0x068)   /* MS interrupt status register */
#define REG_MSBUF1	 (FMI_BA+0x06C)   /* Memory stick register buffer 1 */
#define REG_MSBUF2	 (FMI_BA+0x070)   /* Memory stick register buffer 2 */

/* SmartMedia Registers definition */
#define REG_SMCSR    (FMI_BA+0x0A0)   /* SmartMedia control register */
#define REG_SMTCR    (FMI_BA+0x0A4)   /* SmartMedia control register */
#define REG_SMIER    (FMI_BA+0x0A8)   /* SmartMedia interrupt enable register */
#define REG_SMISR    (FMI_BA+0x0AC)   /* SmartMedia input signal and interrupt status register */
#define REG_SMCMD    (FMI_BA+0x0B0)   /* SmartMedia command port register */
#define REG_SMADDR   (FMI_BA+0x0B4)   /* SmartMedia address port register */
#define REG_SMDATA   (FMI_BA+0x0B8)   /* SmartMedia data port register */
#define REG_SMECC0   (FMI_BA+0x0BC)   /* SmartMedia error correction code 0 regisrer */
#define REG_SMECC1   (FMI_BA+0x0C0)   /* SmartMedia error correction code 1 regisrer */
#define REG_SMECC2   (FMI_BA+0x0C4)   /* SmartMedia error correction code 2 regisrer */
#define REG_SMECC3   (FMI_BA+0x0C8)   /* SmartMedia error correction code 3 regisrer */
#define REG_SMRA_0   (FMI_BA+0x0CC)   /* SmartMedia redundant area register */
#define REG_SMRA_1   (FMI_BA+0x0D0)   /* SmartMedia redundant area register */
#define REG_SMRA_2   (FMI_BA+0x0D4)   /* SmartMedia redundant area register */
#define REG_SMRA_3   (FMI_BA+0x0D8)   /* SmartMedia redundant area register */
#define REG_SMRA_4   (FMI_BA+0x0DC)   /* SmartMedia redundant area register */
#define REG_SMRA_5   (FMI_BA+0x0E0)   /* SmartMedia redundant area register */
#define REG_SMRA_6   (FMI_BA+0x0E4)   /* SmartMedia redundant area register */
#define REG_SMRA_7   (FMI_BA+0x0E8)   /* SmartMedia redundant area register */
#define REG_SMRA_8   (FMI_BA+0x0EC)   /* SmartMedia redundant area register */
#define REG_SMRA_9   (FMI_BA+0x0F0)   /* SmartMedia redundant area register */
#define REG_SMRA_10  (FMI_BA+0x0F4)   /* SmartMedia redundant area register */
#define REG_SMRA_11  (FMI_BA+0x0F8)   /* SmartMedia redundant area register */
#define REG_SMRA_12  (FMI_BA+0x0FC)   /* SmartMedia redundant area register */
#define REG_SMRA_13  (FMI_BA+0x100)   /* SmartMedia redundant area register */
#define REG_SMRA_14  (FMI_BA+0x104)   /* SmartMedia redundant area register */
#define REG_SMRA_15  (FMI_BA+0x108)   /* SmartMedia redundant area register */
#define REG_SMECCAD0 (FMI_BA+0x10C)   /* SmartMedia ECC correction address register 0 */
#define REG_SMECCAD1 (FMI_BA+0x110)   /* SmartMedia ECC correction address register 1 */
#define REG_SMECC4ST (FMI_BA+0x114)   /* SmartMedia ECC4 correction status register */
#define REG_SMECC4F1A1 (FMI_BA+0x118) /* SmartMedia ECC4 field-1 error address-1 register */
#define REG_SMECC4F1A2 (FMI_BA+0x11C) /* SmartMedia ECC4 field-1 error address-2 register */
#define REG_SMECC4F1D  (FMI_BA+0x120) /* SmartMedia ECC4 field-1 error data register */
#define REG_SMECC4F2A1 (FMI_BA+0x124) /* SmartMedia ECC4 field-2 error address-1 register */
#define REG_SMECC4F2A2 (FMI_BA+0x128) /* SmartMedia ECC4 field-2 error address-2 register */
#define REG_SMECC4F2D  (FMI_BA+0x12C) /* SmartMedia ECC4 field-2 error data register */
#define REG_SMECC4F3A1 (FMI_BA+0x130) /* SmartMedia ECC4 field-3 error address-1 register */
#define REG_SMECC4F3A2 (FMI_BA+0x134) /* SmartMedia ECC4 field-3 error address-2 register */
#define REG_SMECC4F3D  (FMI_BA+0x138) /* SmartMedia ECC4 field-3 error data register */
#define REG_SMECC4F4A1 (FMI_BA+0x13C) /* SmartMedia ECC4 field-4 error address-1 register */
#define REG_SMECC4F4A2 (FMI_BA+0x140) /* SmartMedia ECC4 field-4 error address-2 register */
#define REG_SMECC4F4D  (FMI_BA+0x144) /* SmartMedia ECC4 field-4 error data register */

 
/**********************************************************************************************************
 *                                                               
 * 8. Audio Interface Control Registers  
 *
 **********************************************************************************************************/
#define REG_ACTL_CON			(ADO_BA + 0x00)   /* Audio controller control register */
#define REG_ACTL_RESET			(ADO_BA + 0x04)   /* Sub block reset control register */
#define REG_ACTL_RDSTB			(ADO_BA + 0x08)   /* DMA destination base address register for record */
#define REG_ACTL_RDST_LENGTH	(ADO_BA + 0x0C)   /* DMA destination length register for record */
#define REG_ACTL_PDSTB			(ADO_BA + 0x18)   /* DMA destination base address register for play */
#define REG_ACTL_PDST_LENGTH	(ADO_BA + 0x1C)   /* DMA destination length register for play */
#define REG_ACTL_RSR			(ADO_BA + 0x14)   /* Record status register */
#define REG_ACTL_PSR			(ADO_BA + 0x24)   /* Play status register */
#define REG_ACTL_IISCON			(ADO_BA + 0x28)   /* IIS control register */
#define REG_ACTL_ACCON			(ADO_BA + 0x2C)   /* AC-link control register */
#define REG_ACTL_ACOS0			(ADO_BA + 0x30)   /* AC-link out slot 0 */
#define REG_ACTL_ACOS1			(ADO_BA + 0x34)   /* AC-link out slot 1 */
#define REG_ACTL_ACOS2			(ADO_BA + 0x38)   /* AC-link out slot 2 */
#define REG_ACTL_ACIS0			(ADO_BA + 0x3C)   /* AC-link in slot 0 */
#define REG_ACTL_ACIS1			(ADO_BA + 0x40)   /* AC-link in slot 1 */
#define REG_ACTL_ACIS2			(ADO_BA + 0x44)   /* AC-link in slot 2 */
#define REG_ACTL_ADCON			(ADO_BA + 0x48)   /* ADC0 control register */
#define REG_ACTL_M80CON			(ADO_BA + 0x4C)   /* M80 interface control register */
#define REG_ACTL_M80DATA0		(ADO_BA + 0x50)   /* M80 data0 register */
#define REG_ACTL_M80DATA1		(ADO_BA + 0x54)   /* M80 data1 register */
#define REG_ACTL_M80DATA2		(ADO_BA + 0x58)   /* M80 data2 register */
#define REG_ACTL_M80DATA3		(ADO_BA + 0x5C)   /* M80 data3 register */
#define REG_ACTL_M80ADDR		(ADO_BA + 0x60)   /* M80 interface start address register */
#define REG_ACTL_M80SRADDR		(ADO_BA + 0x64)   /* M80 interface start address register of right channel */
#define REG_ACTL_M80SIZE		(ADO_BA + 0x70)   /* M80 interface data size register */
#define REG_ACTL_DACON			(ADO_BA + 0x74)   /* DAC control register */
 
 
/**********************************************************************************************************
 *                                                               
 * 9. USB Device Control Registers  
 *
 **********************************************************************************************************/
#define REG_USBD_IRQ_STAT_L		(USBD_BA+0x00)		/* interrupt status low register */
#define REG_USBD_IRQ_ENB_L		(USBD_BA+0x08)		/* interrupt enable low register */
#define REG_USBD_IRQ_STAT		(USBD_BA+0x10)		/* usb interrupt status register */
#define REG_USBD_IRQ_ENB		(USBD_BA+0x14)		/* usb interrupt enable register */
#define REG_USBD_OPER			(USBD_BA+0x18)		/* usb operation register */
#define REG_USBD_FRAME_CNT		(USBD_BA+0x1c)		/* usb frame count register */
#define REG_USBD_ADDR			(USBD_BA+0x20)		/* usb address register */
#define REG_USBD_TEST			(USBD_BA+0x24)		/* usb test mode register */
#define REG_USBD_CEP_DATA_BUF	(USBD_BA+0x28)		/* control-ep data buffer register */
#define REG_USBD_CEP_CTRL_STAT	(USBD_BA+0x2c)		/* control-ep control and status register */
#define REG_USBD_CEP_IRQ_ENB	(USBD_BA+0x30)		/* control-ep interrupt enable register */
#define REG_USBD_CEP_IRQ_STAT	(USBD_BA+0x34)		/* control-ep interrupt status register */
#define REG_USBD_IN_TRNSFR_CNT	(USBD_BA+0x38)		/* in-transfer data count register */
#define REG_USBD_OUT_TRNSFR_CNT	(USBD_BA+0x3c)		/* out-transfer data count register */
#define REG_USBD_CEP_CNT		(USBD_BA+0x40)		/* control-ep data count register */
#define REG_USBD_SETUP1_0		(USBD_BA+0x44)		/* setup byte1 & byte0 register */
#define REG_USBD_SETUP3_2		(USBD_BA+0x48)		/* setup byte3 & byte2 register */
#define REG_USBD_SETUP5_4		(USBD_BA+0x4c)		/* setup byte5 & byte4 register */
#define REG_USBD_SETUP7_6		(USBD_BA+0x50)		/* setup byte7 & byte6 register */
#define REG_USBD_CEP_START_ADDR	(USBD_BA+0x54)		/* control-ep ram start address register */
#define REG_USBD_CEP_END_ADDR	(USBD_BA+0x58)		/* control-ep ram end address register */
#define REG_USBD_DMA_CTRL_STS	(USBD_BA+0x5c)		/* dma control and status register */
#define REG_USBD_DMA_CNT		(USBD_BA+0x60)		/* dma count register */
/* endpoint A */
#define REG_USBD_EPA_DATA_BUF	(USBD_BA+0x64)		/* endpoint A data buffer register */
#define REG_USBD_EPA_IRQ_STAT	(USBD_BA+0x68)		/* endpoint A interrupt status register */
#define REG_USBD_EPA_IRQ_ENB	(USBD_BA+0x6c)		/* endpoint A interrupt enable register */
#define REG_USBD_EPA_DATA_CNT	(USBD_BA+0x70)		/* data count available in endpoint A buffer */
#define REG_USBD_EPA_RSP_SC		(USBD_BA+0x74)		/* endpoint A response register set/clear */
#define REG_USBD_EPA_MPS		(USBD_BA+0x78)		/* endpoint A max packet size register */
#define REG_USBD_EPA_TRF_CNT	(USBD_BA+0x7c)		/* endpoint A transfer count register */
#define REG_USBD_EPA_CFG		(USBD_BA+0x80)		/* endpoint A configuration register */
#define REG_USBD_EPA_START_ADDR	(USBD_BA+0x84)		/* endpoint A ram start address register */
#define REG_USBD_EPA_END_ADDR	(USBD_BA+0x88)		/* endpoint A ram end address register */
/* endpoint B */
#define REG_USBD_EPB_DATA_BUF	(USBD_BA+0x8c)		/* endpoint B data buffer register */
#define REG_USBD_EPB_IRQ_STAT	(USBD_BA+0x90)		/* endpoint B interrupt status register */
#define REG_USBD_EPB_IRQ_ENB	(USBD_BA+0x94)		/* endpoint B interrupt enable register */
#define REG_USBD_EPB_DATA_CNT	(USBD_BA+0x98)		/* data count available in endpoint B buffer */
#define REG_USBD_EPB_RSP_SC		(USBD_BA+0x9c)		/* endpoint B response register set/clear */
#define REG_USBD_EPB_MPS		(USBD_BA+0xa0)		/* endpoint B max packet size register */
#define REG_USBD_EPB_TRF_CNT	(USBD_BA+0xa4)		/* endpoint B transfer count register */
#define REG_USBD_EPB_CFG		(USBD_BA+0xa8)		/* endpoint B configuration register */
#define REG_USBD_EPB_START_ADDR	(USBD_BA+0xac)		/* endpoint B ram start address register */
#define REG_USBD_EPB_END_ADDR	(USBD_BA+0xb0)		/* endpoint B ram end address register */
/* endpoint C */
#define REG_USBD_EPC_DATA_BUF	(USBD_BA+0xb4)		/* endpoint C data buffer register */
#define REG_USBD_EPC_IRQ_STAT	(USBD_BA+0xb8)		/* endpoint C interrupt status register */
#define REG_USBD_EPC_IRQ_ENB	(USBD_BA+0xbc)		/* endpoint C interrupt enable register */
#define REG_USBD_EPC_DATA_CNT	(USBD_BA+0xc0)		/* data count available in endpoint C buffer */
#define REG_USBD_EPC_RSP_SC		(USBD_BA+0xc4)		/* endpoint C response register set/clear */
#define REG_USBD_EPC_MPS		(USBD_BA+0xc8)		/* endpoint C max packet size register */
#define REG_USBD_EPC_TRF_CNT	(USBD_BA+0xcc)		/* endpoint C transfer count register */
#define REG_USBD_EPC_CFG		(USBD_BA+0xd0)		/* endpoint C configuration register */
#define REG_USBD_EPC_START_ADDR	(USBD_BA+0xd4)		/* endpoint C ram start address register */
#define REG_USBD_EPC_END_ADDR	(USBD_BA+0xd8)		/* endpoint C ram end address register */
/* endpoint D */
#define REG_USBD_EPD_DATA_BUF	(USBD_BA+0xdc)		/* endpoint D data buffer register */
#define REG_USBD_EPD_IRQ_STAT	(USBD_BA+0xe0)		/* endpoint D interrupt status register */
#define REG_USBD_EPD_IRQ_ENB	(USBD_BA+0xe4)		/* endpoint D interrupt enable register */
#define REG_USBD_EPD_DATA_CNT	(USBD_BA+0xe8)		/* data count available in endpoint D buffer */
#define REG_USBD_EPD_RSP_SC		(USBD_BA+0xec)		/* endpoint D response register set/clear */
#define REG_USBD_EPD_MPS		(USBD_BA+0xf0)		/* endpoint D max packet size register */
#define REG_USBD_EPD_TRF_CNT	(USBD_BA+0xf4)		/* endpoint D transfer count register */
#define REG_USBD_EPD_CFG		(USBD_BA+0xf8)		/* endpoint D configuration register */
#define REG_USBD_EPD_START_ADDR	(USBD_BA+0xfc)		/* endpoint D ram start address register */
#define REG_USBD_EPD_END_ADDR	(USBD_BA+0x100)		/* endpoint D ram end address register */
/* endpoint E */
#define REG_USBD_EPE_DATA_BUF	(USBD_BA+0x104)		/* endpoint E data buffer register */
#define REG_USBD_EPE_IRQ_STAT	(USBD_BA+0x108)		/* endpoint E interrupt status register */
#define REG_USBD_EPE_IRQ_ENB	(USBD_BA+0x10c)		/* endpoint E interrupt enable register */
#define REG_USBD_EPE_DATA_CNT	(USBD_BA+0x110)		/* data count available in endpoint E buffer */
#define REG_USBD_EPE_RSP_SC		(USBD_BA+0x114)		/* endpoint E response register set/clear */
#define REG_USBD_EPE_MPS		(USBD_BA+0x118)		/* endpoint E max packet size register */
#define REG_USBD_EPE_TRF_CNT	(USBD_BA+0x11c)		/* endpoint E transfer count register */
#define REG_USBD_EPE_CFG		(USBD_BA+0x120)		/* endpoint E configuration register */
#define REG_USBD_EPE_START_ADDR	(USBD_BA+0x124)		/* endpoint E ram start address register */
#define REG_USBD_EPE_END_ADDR	(USBD_BA+0x128)		/* endpoint E ram end address register */
/* endpoint F */
#define REG_USBD_EPF_DATA_BUF	(USBD_BA+0x12c)		/* endpoint F data buffer register */
#define REG_USBD_EPF_IRQ_STAT	(USBD_BA+0x130)		/* endpoint F interrupt status register */
#define REG_USBD_EPF_IRQ_ENB	(USBD_BA+0x134)		/* endpoint F interrupt enable register */
#define REG_USBD_EPF_DATA_CNT	(USBD_BA+0x138)		/* data count available in endpoint F buffer */
#define REG_USBD_EPF_RSP_SC		(USBD_BA+0x13c)		/* endpoint F response register set/clear */
#define REG_USBD_EPF_MPS		(USBD_BA+0x140)		/* endpoint F max packet size register */
#define REG_USBD_EPF_TRF_CNT	(USBD_BA+0x144)		/* endpoint F transfer count register */
#define REG_USBD_EPF_CFG		(USBD_BA+0x148)		/* endpoint F configuration register */
#define REG_USBD_EPF_START_ADDR	(USBD_BA+0x14c)		/* endpoint F ram start address register */
#define REG_USBD_EPF_END_ADDR	(USBD_BA+0x150)		/* endpoint F ram end address register */
#define REG_USBD_AHB_DMA_ADDR	(USBD_BA+0x700)		/* AHB_DMA address register */
#define REG_USBD_PHY_CTL		(USBD_BA+0x704)		/* PHY control register */


/**********************************************************************************************************
 *                                                               
 * 10. LCM Control Registers  
 *
 **********************************************************************************************************/
#define REG_LCM_DCCS	     (LCM_BA+0x00)    /* Display Controller Control/Status Register */
#define REG_LCM_DEV_CTRL     (LCM_BA+0x04)    /* Display Output Device Control Register */
#define REG_LCM_MPU_CMD	     (LCM_BA+0x08)    /* MPU-Interface LCD Write Command */
#define REG_LCM_INT_CS	     (LCM_BA+0x0c)    /* Interrupt Control/Status Register */
#define REG_LCM_CRTC_SIZE    (LCM_BA+0x10)    /* CRTC Display Size Control Register */
#define REG_LCM_CRTC_DEND    (LCM_BA+0x14)    /* CRTC Display Enable End */
#define REG_LCM_CRTC_HR	     (LCM_BA+0x18)    /* CRTC Internal Horizontal Retrace Control Register */
#define REG_LCM_CRTC_HSYNC   (LCM_BA+0x1C)    /* CRTC Horizontal Sync Control Register */
#define REG_LCM_CRTC_VR	     (LCM_BA+0x20)    /* CRTC Internal Vertical Retrace Control Register */
#define REG_LCM_VA_BADDR0    (LCM_BA+0x24)    /* Video Stream Frame Buffer-0 Starting Address */
#define REG_LCM_VA_BADDR1    (LCM_BA+0x28)    /* Video Stream Frame Buffer-1 Starting Address */
#define REG_LCM_VA_FBCTRL    (LCM_BA+0x2C)    /* Video Stream Frame Buffer Control Register */
#define REG_LCM_VA_SCALE     (LCM_BA+0x30)    /* Video Stream Scaling Control Register */
#define REG_LCM_VA_TEST      (LCM_BA+0x34)    /* Test mode control register */
#define REG_LCM_OSD_WIN_S    (LCM_BA+0x40)    /* OSD Window Starting Coordinates */
#define REG_LCM_OSD_WIN_E    (LCM_BA+0x44)    /* OSD Window Ending Coordinates */
#define REG_LCM_OSD_BADDR    (LCM_BA+0x48)    /* OSD Stream Frame Buffer Starting Address */
#define REG_LCM_OSD_FBCTRL   (LCM_BA+0x4c)    /* OSD Stream Frame Buffer Control Register */
#define REG_LCM_OSD_OVERLAY  (LCM_BA+0x50)    /* OSD Overlay Control Register */
#define REG_LCM_OSD_CKEY     (LCM_BA+0x54)    /* OSD Overlay Color-Key Pattern Register */
#define REG_LCM_OSD_CMASK    (LCM_BA+0x58)    /* OSD Overlay Color-Key Mask Register */


/**********************************************************************************************************
 *                                                               
 * 11. Sensor DSP Control Registers  
 *
 **********************************************************************************************************/
#define REG_DSPFunctionCR		(DSP_BA+0x00)    /* Switches of Sub-blocks */
#define	REG_DSPInterruptCR		(DSP_BA+0x04)    /* Interrupt Mask and Status */

/* Sensor interface control REG_isters */
#define	REG_DSPInterfaceCR		(DSP_BA+0x08)    /* Sensor Interface */
#define REG_DSPHsyncCR1			(DSP_BA+0x0C)    /* Master mode Hsync position */
#define REG_DSPHsyncCR2			(DSP_BA+0x10)    /* Master mode Hsync width */
#define REG_DSPVsyncCR1			(DSP_BA+0x14)    /* Master mode Vsync position */
#define REG_DSPVsyncCR2			(DSP_BA+0x18)    /* Master mode Vsync width */
#define REG_DSPLineCounter		(DSP_BA+0x1C)    /* Current Line Position */

/* Black level control REG_isters */
#define	REG_DSPBlackLMode		(DSP_BA+0x20)    /* Black Level Clamping Mode */
#define REG_DSPBlackLCropCR1	(DSP_BA+0x24)    /* Black Level Clamping Parameters */
#define	REG_DSPBlackLCropCR2	(DSP_BA+0x28)    /* Position of Black Level Window */
#define REG_DSPUserBlackLCR		(DSP_BA+0x2C)    /* User defined black level */
#define	REG_DSPFrameDBL			(DSP_BA+0x30)    /* Frame base detected black level */

/* Cropping window */
#define REG_DSPCropCR1			(DSP_BA+0x34)    /* Starting Address of Cropping Window */
#define	REG_DSPCropCR2			(DSP_BA+0x38)    /* Width and Height of Cropping Window */

