OpenNuvoton/NUC970_U-Boot/arch/arm/include/asm/arch-nuc970/nuc900_cpu.h
/* digital programmable gain multiplier */
#define REG_DSPColorBalCR1		(DSP_BA+0x3C)    /* Gain factor for R and B */
#define	REG_DSPColorBalCR2		(DSP_BA+0x40)    /* Gain factor for Gr and Gb */

/* MCG and edge enhancement */
#define	REG_DSPMCGCR			(DSP_BA+0x44)    /* MCG Threshold */
#define	REG_DSPEdgeConfigCR		(DSP_BA+0x48)    /* Edge Configuration */

/* Color correction matrix */
#define	REG_DSPColorMatrixCR1	(DSP_BA+0x4C)    /* Color Correction Matrix -1 */
#define	REG_DSPColorMatrixCR2	(DSP_BA+0x50)    /* Color Correction Matrix -2 */
#define	REG_DSPColorMatrixCR3	(DSP_BA+0x54)    /* Color Correction Matrix -3 */

/* High saturation suppression */
#define	REG_DSPHSSCR			(DSP_BA+0x60)    /* High Saturation Suppression */

/* Gamma correction matrix */
#define	REG_DSPGammaCR			(DSP_BA+0x64)    /* Gamma Correction Type Selection */
#define	REG_DSPGammaTbl1		(DSP_BA+0x70)    /* Gamma Correction Table 0x70 ~ 0xAC */
#define	REG_DSPGammaTbl2		(DSP_BA+0x74)
#define	REG_DSPGammaTbl3		(DSP_BA+0x78)
#define	REG_DSPGammaTbl4		(DSP_BA+0x7C)
#define	REG_DSPGammaTbl5		(DSP_BA+0x80)
#define	REG_DSPGammaTbl6		(DSP_BA+0x84)
#define	REG_DSPGammaTbl7		(DSP_BA+0x88)
#define	REG_DSPGammaTbl8		(DSP_BA+0x8C)
#define	REG_DSPGammaTbl9		(DSP_BA+0x90)
#define	REG_DSPGammaTbl10		(DSP_BA+0x94)
#define	REG_DSPGammaTbl11		(DSP_BA+0x98)
#define	REG_DSPGammaTbl12		(DSP_BA+0x9C)
#define	REG_DSPGammaTbl13		(DSP_BA+0xA0)
#define	REG_DSPGammaTbl14		(DSP_BA+0xA4)
#define	REG_DSPGammaTbl15		(DSP_BA+0xA8)
#define	REG_DSPGammaTbl16		(DSP_BA+0xAC)

/* Auto Exposure */
#define REG_DSPAECCR1			(DSP_BA+0xB0)    /* Foreground Window */
#define REG_DSPAECAvg			(DSP_BA+0xB4)    /* AEC Statistics */

/* Auto White Balance */
#define	REG_DSPAWBWndCR			(DSP_BA+0xB8)    /* Window for AWB */
#define	REG_DSPAWBWOCR1			(DSP_BA+0xBC)    /* White object definition */
#define	REG_DSPAWBWOCR2			(DSP_BA+0xC0)    /* White object definition */
#define REG_DSPAWBCR			(DSP_BA+0xC4)    /* White object definition */
#define	REG_DSPAWBWOCount		(DSP_BA+0xC8)    /* Total White Points */
#define	REG_DSPAWBWOAvg			(DSP_BA+0xCC)    /* Average R, G, B of White Points */

/* Auto Focus */
#define	REG_DSPAFCR				(DSP_BA+0xD0)    /* AF Window Setting */
#define	REG_DSPAFreport			(DSP_BA+0xD4)    /* Auto Focus Statistics */

/* Histogram */
#define	REG_DSPHistoCR			(DSP_BA+0xD8)    /* Histogram Configuration */
#define	REG_DSPHistoReport1		(DSP_BA+0xDC)    /* Histogram Statistics -1 */
#define	REG_DSPHistoReport2		(DSP_BA+0xE0)    /* Histogram Statistics -2 */
#define	REG_DSPHistoReport3		(DSP_BA+0xE4)    /* Histogram Statistics -3 */
#define	REG_DSPHistoReport4		(DSP_BA+0xE8)    /* Histogram Statistics -4 */
#define	REG_DSPHistoReport5		(DSP_BA+0xEC)    /* Histogram Statistics -5 */
#define	REG_DSPHistoReport6 	(DSP_BA+0xF0)    /* Histogram Statistics -6 */

/* Sub-Windows */
#define REG_DSPSubWndCR1		(DSP_BA+0xF4)    /* Sub-Windows Definitions */
#define REG_DSPSubWndCR2		(DSP_BA+0xF8)    /* Sub-Windows Definitions */
#define REG_DSPSubWndAvgY1		(DSP_BA+0x100)   /* Reported values 0x100 ~ 0x13C */
#define REG_DSPSubWndAvgY2		(DSP_BA+0x104)
#define REG_DSPSubWndAvgY3		(DSP_BA+0x108)
#define REG_DSPSubWndAvgY4		(DSP_BA+0x10C)
#define REG_DSPSubWndAvgR1		(DSP_BA+0x110)
#define REG_DSPSubWndAvgR2		(DSP_BA+0x114)
#define REG_DSPSubWndAvgR3		(DSP_BA+0x118)
#define REG_DSPSubWndAvgR4		(DSP_BA+0x11C)
#define REG_DSPSubWndAvgG1		(DSP_BA+0x120)
#define REG_DSPSubWndAvgG2		(DSP_BA+0x124)
#define REG_DSPSubWndAvgG3		(DSP_BA+0x128)
#define REG_DSPSubWndAvgG4		(DSP_BA+0x12C)
#define REG_DSPSubWndAvgB1		(DSP_BA+0x130)
#define REG_DSPSubWndAvgB2		(DSP_BA+0x134)
#define REG_DSPSubWndAvgB3		(DSP_BA+0x138)
#define REG_DSPSubWndAvgB4		(DSP_BA+0x13C)

/* Bad uPixels */
#define	REG_DSPBadPixelCR		(DSP_BA+0x140)    /* Bad-Pixel Positions */
#define REG_DSPBadPixelIndex	(DSP_BA+0x144)    /* Bad-Pixel Index */
 
 
/**********************************************************************************************************
 *                                                               
 * 12. Video Capture Engine Control Registers  
 *
 **********************************************************************************************************/
#define REG_CAPEngine             (CAP_BA+0x00)   /* VPRE Engine Status */
#define REG_CAPFuncEnable         (CAP_BA+0x04)   /* Sub-Function Control */
#define REG_CAPColorMode          (CAP_BA+0x08)   /* VPRE Color Feature Register */
#define REG_CAPRotationMode       (CAP_BA+0x0C)   /* VPRE Rotation Mode Register */
#define REG_CAPInterfaceConf      (CAP_BA+0x10)   /* VPRE interface configuration */
#define REG_CAPCropWinStarPos     (CAP_BA+0x14)   /* VPRE Cropping Window Starting Position */
#define REG_CAPCropWinSize        (CAP_BA+0x18)   /* VPRE Cropping Window Size */
#define REG_CAPDownScaleFilter    (CAP_BA+0x1C)   /* Down Scale Factor Register */
#define REG_CAPPlaDownScale       (CAP_BA+0x20)   /* Planar Scale Factor Register */
#define REG_CAPlaRealSize         (CAP_BA+0x24)   /* Planar Real Image Size */
#define REG_CAPPacDownScale       (CAP_BA+0x28)   /* Packet Scale Factor Register */
#define REG_CAPPacRealSize        (CAP_BA+0x2C)   /* Packet Real Image Size */
#define REG_CAPPlaYFB0StaAddr     (CAP_BA+0x30)   /* Planar Y pipe Frame buffer 0 starting address */
#define REG_CAPPlaUFB0StaAddr     (CAP_BA+0x34)   /* Planar U pipe Frame buffer 0 starting address */
#define REG_CAPPlaVFB0StaAddr     (CAP_BA+0x38)   /* Planar V pipe Frame buffer 0 starting addres */
#define REG_CAPPacFB0StaAddr      (CAP_BA+0x3C)   /* Packet pipe Frame buffer 0 starting address */
#define REG_CAPPlaYFB1StaAddr     (CAP_BA+0x40)   /* Planar Y pipe Frame buffer 1 starting address */
#define REG_CAPPlaUFB1StaAddr     (CAP_BA+0x44)   /* Planar U pipe Frame buffer 1 starting address */
#define REG_CAPPlaVFB1StaAddr     (CAP_BA+0x48)   /* Planar V pipe Frame buffer 1 starting address */
#define REG_CAPPacFB1StaAddr      (CAP_BA+0x4C)   /* Packet pipe Frame buffer 1 starting address */
#define REG_CAPPlaMaskStaAddr     (CAP_BA+0x50)   /* Planar Overlap mask starting address */
#define REG_CAPPacMaskStaAddr     (CAP_BA+0x54)   /* Packet Overlap mask starting address */
#define REG_CAPPlaLineOffset      (CAP_BA+0x58)   /* Planar line offset value */
#define REG_CAPPacLineOffset      (CAP_BA+0x5C)   /* Packet line offset value */
#define REG_CAPFIFOThreshold      (CAP_BA+0x60)   /* FIFO threshold value */
#define	REG_LensShadingCR1		  (CAP_BA+0x64)   /* CFA type and shift value */
#define	REG_LensShadingCR2	      (CAP_BA+0x68)   /* The center position */
#define	REG_LensShadingCR3	      (CAP_BA+0x6C)   /* The coefficients for Y or R */
#define	REG_LensShadingCR4	      (CAP_BA+0x70)   /* The coefficients for U or G */
#define	REG_LensShadingCR5	      (CAP_BA+0x74)   /* The coefficients for V or B */
#define	REG_DSPVideoQuaCR1	      (CAP_BA+0x78)   /* Brightness and Contrast */
#define	REG_DSPVideoQuaCR2	      (CAP_BA+0x7C)   /* Hue and Saturation */

 
/**********************************************************************************************************
 *                                                               
 * 13. JPEG Codec Control Registers  
 *
 **********************************************************************************************************/
#define JREGNUM			(0x1BC / 4 + 1)    /* The number of JPEG registers. */

#define REG_JMCR		(JPG_BA + 0x000)   /* JPEG Mode Control Register */
#define REG_JHEADER		(JPG_BA + 0x004)   /* JPEG Encode Header Control Register */
#define REG_JITCR		(JPG_BA + 0x008)   /* JPEG Image Type Control Register */
#define REG_JPRIQC		(JPG_BA + 0x010)   /* JPEG Encode Primary Q-Table Control Register */
#define REG_JTHBQC		(JPG_BA + 0x014)   /* JPEG Encode Thumbnail Q-Table Control Register */
#define REG_JPRIWH		(JPG_BA + 0x018)   /* JPEG Encode Primary Width/Height Register */
#define REG_JTHBWH		(JPG_BA + 0x01C)   /* JPEG Encode Thumbnail Width/Height Register */
#define REG_JPRST		(JPG_BA + 0x020)   /* JPEG Encode Primary Restart Interval Register */
#define REG_JTRST		(JPG_BA + 0x024)   /* JPEG Encode Thumbnail Restart Interval Register */
#define REG_JDECWH		(JPG_BA + 0x028)   /* JPEG Decode Image Width/Height Register */
#define REG_JINTCR		(JPG_BA + 0x02C)   /* JPEG Interrupt Control and Status Register */
#define REG_JDCOLC		(JPG_BA + 0x030)   /* JPEG Decode Image Color Control Register */
#define REG_JDCOLP		(JPG_BA + 0x034)   /* JPEG Decode Image Color Pattern Register */
#define REG_JTEST		(JPG_BA + 0x040)   /* JPEG Test Mode Control Register */
#define REG_JWINDEC0	(JPG_BA + 0x044)   /* JPEG Window Decode Mode Control Register 0 */
#define REG_JWINDEC1	(JPG_BA + 0x048)   /* JPEG Window Decode Mode Control Register 1 */
#define REG_JWINDEC2	(JPG_BA + 0x04C)   /* JPEG Window Decode Mode Control Register 2 */
#define REG_JMACR		(JPG_BA + 0x050)   /* JPEG Memory Address Mode Control Registe */
#define REG_JPSCALU		(JPG_BA + 0x054)   /* JPEG Primary Scaling-Up Control Register */
#define REG_JPSCALD		(JPG_BA + 0x058)   /* JPEG Primary Scaling-Down Control Register */
#define REG_JTSCALD		(JPG_BA + 0x05C)   /* JPEG Thumbnail Scaling-Down Control Register */
#define REG_JDBCR		(JPG_BA + 0x060)   /* Dual-Buffer Control Register */
#define REG_JRESERVE	(JPG_BA + 0x070)   /* Primary Encode Bit-stream Reserved Size Register */
#define REG_JOFFSET		(JPG_BA + 0x074)   /* Address Offset Between Primary/Thumbnail Register */
#define REG_JFSTRIDE	(JPG_BA + 0x078)   /* JPEG Encode Bit-stream Frame Stride Register */
#define REG_JYADDR0		(JPG_BA + 0x07C)   /* Y Component Frame Buffer-0 Start Address Register */
#define REG_JUADDR0		(JPG_BA + 0x080)   /* U Component Frame Buffer-0 Start Address Register */
#define REG_JVADDR0		(JPG_BA + 0x084)   /* V Component Frame Buffer-0 Start Address Register */
#define REG_JYADDR1		(JPG_BA + 0x088)   /* Y Component Frame Buffer-1 Start Address Register */
#define REG_JUADDR1		(JPG_BA + 0x08C)   /* U Component Frame Buffer-1 Start Address Register */
#define REG_JVADDR1		(JPG_BA + 0x090)   /* V Component Frame Buffer-1 Start Address Register */
#define REG_JYSTRIDE	(JPG_BA + 0x094)   /* Y Component Frame Buffer Stride Register */
#define REG_JUSTRIDE	(JPG_BA + 0x098)   /* U Component Frame Buffer Stride Register */
#define REG_JVSTRIDE	(JPG_BA + 0x09C)   /* V Component Frame Buffer Stride Register */
#define REG_JIOADDR0	(JPG_BA + 0x0A0)   /* Bit-stream Frame Buffer-0 Start Address Register */
#define REG_JIOADDR1	(JPG_BA + 0x0A4)   /* Bit-stream Frame Buffer-1 Start Address Register */
#define REG_JPRI_SIZE	(JPG_BA + 0x0A8)   /* JPEG Encode Primary Bit-stream Size Register */
#define REG_JTHB_SIZE	(JPG_BA + 0x0AC)   /* JPEG Encode Thumbnail Bit-stream Size Register */
#define REG_JSRCWH		(JPG_BA + 0x0B0)   /* JPEG Encode Source Image Width/Height Register */

/* QTable 0 ~ 2 
   1. Needs to be programmed in byte unit.
   2. While reading QTAB, it must read twice to get the correct data due to the QTAB is realized by SRAM. */
#define REG_JQTAB0		(JPG_BA + 0x100) /* The start address of JPEG Quantization-Table 0. 0x100 ~ 0x13C */
#define REG_JQTAB1		(JPG_BA + 0x140) /* The start address of JPEG Quantization-Table 1. 0x140 ~ 0x17C */
#define REG_JQTAB2		(JPG_BA + 0x180) /* The start address of JPEG Quantization-Table 2. 0x180 ~ 0x1BC */
 
 
/**********************************************************************************************************
 *                                                               
 * 14. MPEG-4 Video Codec Control Registers  
 *
 **********************************************************************************************************/
/* Encoder DMA map */ 
#define	REG_MP4_INTERRUPT					(MP4_BA+0x038) 
#define	REG_MP4_HOSTIF_DELAY				(MP4_BA+0x040) 

/* Encoder DMA map */ 
#define	REG_ENC_MBF_DMA_CSR				    (MP4_BA+0x3A8)
#define	REG_ENC_MBF_DMA_THSH				(MP4_BA+0x3B0)
#define	REG_ENC_MBF_DMA_ADRS				(MP4_BA+0x3B8)

#define	REG_ENC_MOF_DMA_CSR				    (MP4_BA+0x3C8)
#define	REG_ENC_MOF_DMA_THSH				(MP4_BA+0x3D0)
#define	REG_ENC_MOF_DMA_ADRS				(MP4_BA+0x3D8)

