OpenNuvoton/NUC970_U-Boot/arch/arm/include/asm/arch-nuc970/nuc900_cpu.h
#define	REG_ENC_MIF_DMA_CSR				    (MP4_BA+0x3E8)
#define	REG_ENC_MIF_DMA_THSH				(MP4_BA+0x3F0)
#define	REG_ENC_MIF_DMA_ADRS				(MP4_BA+0x3F8)

/* Decoder DMA map */ 
#define	REG_DEC_MBF_DMA_CSR				    (MP4_BA+0x308)
#define	REG_DEC_MBF_DMA_THSH				(MP4_BA+0x310)
#define	REG_DEC_MBF_DMA_ADRS				(MP4_BA+0x318)

#define	REG_DEC_MOF_DMA_CSR				    (MP4_BA+0x328)
#define	REG_DEC_MOF_DMA_THSH				(MP4_BA+0x330)
#define	REG_DEC_MOF_DMA_ADRS				(MP4_BA+0x338)

#define	REG_DEC_MIF_DMA_CSR				    (MP4_BA+0x348)
#define	REG_DEC_MIF_DMA_THSH				(MP4_BA+0x350)
#define	REG_DEC_MIF_DMA_ADRS				(MP4_BA+0x358)

/* Encoder register map */
#define	REG_ENCODER_CONTROL					(MP4_BA+0x400)	
#define REG_ENCODER_CONTROL_WIDTH			(MP4_BA+0x404)
#define REG_ENCODER_STATUS					(MP4_BA+0x408)	
#define REG_ENCODER_CONTROL_HEIGHT			(MP4_BA+0x40c)	

#define REG_ENCODER_CONTROL_IRQ				(MP4_BA+0x410)
#define REG_ENCODER_CONTROL_VTI				(MP4_BA+0x414)
#define REG_ENCODER_COUNT					(MP4_BA+0x418)
#define REG_ENCODER_CONTROL_FUP				(MP4_BA+0x41C)

#define REG_ENCODER_RATE_OUT				(MP4_BA+0x420)
#define REG_ENCODER_CONFIG					(MP4_BA+0x424)
#define REG_ENCODER_IDENTITY				(MP4_BA+0x428)
#define REG_ENCODER_RATE_IN					(MP4_BA+0x42C)

#define REG_ENCODER_RATE_EX					(MP4_BA+0x430)
#define REG_ENCODER_CONTROL_IO				(MP4_BA+0x434)
#define REG_ENCODER_ADR_INP_Y				(MP4_BA+0x438)
#define REG_ENCODER_ADR_INP_U				(MP4_BA+0x43C)

#define REG_ENCODER_ADR_INP_V				(MP4_BA+0x440)
#define REG_ENCODER_ADR_REF					(MP4_BA+0x444)
#define REG_ENCODER_ADR_REC					(MP4_BA+0x448)	
#define REG_ENCODER_ADR_BIT					(MP4_BA+0x44C)

#define REG_ENCODER_RATE_MAD         		(MP4_BA+0x450)
#define REG_ENCODER_CONTROL_FILTER   		(MP4_BA+0x454)
#define REG_ENCODER_DISTORTION      		(MP4_BA+0x458)
#define REG_ENCODER_QUANT_MATRIX     		(MP4_BA+0x45C)

/*  Decoder REG_ister map */
#define REG_DECODER_CONTROL		     		(MP4_BA+0x600)
#define REG_DECODER_CONTROL_WIDTH	 		(MP4_BA+0x604)
#define REG_DECODER_STATUS            		(MP4_BA+0x608)
#define REG_DECODER_CONTROL_HEIGHT    		(MP4_BA+0x60C)

#define REG_DECODER_CONTROL_IRQ		 		(MP4_BA+0x610)
#define REG_DECODER_CONTROL_IO        		(MP4_BA+0x614)
#define REG_DECODER_STATUS_VTI		 		(MP4_BA+0x618)
#define REG_DECODER_ADR_BIT           		(MP4_BA+0x61C)

#define REG_DECODER_COUNT             		(MP4_BA+0x620)
#define REG_DECODER_ADR_REF_Y         		(MP4_BA+0x624)
#define REG_DECODER_IDENTITY         		(MP4_BA+0x628)
#define REG_DECODER_ADR_REF_U        		(MP4_BA+0x62C)

#define REG_DECODER_ADR_REF_V        		(MP4_BA+0x630)
#define REG_DECODER_ADR_OUT_Y         		(MP4_BA+0x634)
#define REG_DECODER_ADR_OUT_U         		(MP4_BA+0x638)
#define REG_DECODER_ADR_OUT_V         		(MP4_BA+0x63C)

#define REG_DECODER_QUANT_MATRIX      		(MP4_BA+0x640) 
 
 
/**********************************************************************************************************
 *                                                               
 * 15. 2-D Graphic Engine Control Registers  
 *
 **********************************************************************************************************/
#define REG_GE_TRIGGER                  (GE_BA+0x000)      /* trigger control */
#define REG_GE_SRC_START00_ADDR         (GE_BA+0x004)      /* source start (0,0) of X/Y mode */
#define REG_GE_FILTER_SRC_ADDR          (GE_BA+0x004)      /* shared with CR004 */
#define REG_GE_FILTER0                  (GE_BA+0x008)      /* 3x3 filter parameter 1 */
#define REG_GE_FILTER1                  (GE_BA+0x00C)      /* 3x3 filter parameter 2 */
#define REG_GE_INTS                     (GE_BA+0x010)      /* interrupt status */
#define REG_GE_PAT_START_ADDR           (GE_BA+0x014)      /* pattern start */
#define REG_GE_ERR_TERM_STEP_CONST      (GE_BA+0x018)      /* line parameter 1 */
#define REG_GE_FILTER_THRESHOLD         (GE_BA+0x018)      /* 3x3 filter threshold for max clamping */
#define REG_GE_INIT_ERR_COUNT           (GE_BA+0x01C)      /* line parameter 2 */
#define REG_GE_CONTROL                  (GE_BA+0x020)      /* graphics engine control */
#define REG_GE_BACK_COLOR               (GE_BA+0x024)      /* background color */
#define REG_GE_FORE_COLOR               (GE_BA+0x028)      /* foreground color */
#define REG_GE_TRANSPARENCY_COLOR       (GE_BA+0x02C)      /* color key */
#define REG_GE_TRANSPARENCY_MASK        (GE_BA+0x030)      /* color key mask */
#define REG_GE_DEST_START00_ADDR        (GE_BA+0x034)      /* dest start (0,0) of X/Y mode */
#define REG_GE_FILTER_DEST_ADDR         (GE_BA+0x034)      /* shared with CR034 */
#define REG_GE_PITCH                    (GE_BA+0x038)      /* pitch of X/Y mode */
#define REG_GE_FILTER_PITCH             (GE_BA+0x038)      /* shared with CR038 */
#define REG_GE_SRC_START_ADDR           (GE_BA+0x03C)      /* source start of BitBLT */
#define REG_GE_DEST_START_ADDR          (GE_BA+0x040)      /* dest start of BitBLT */
#define REG_GE_DIMENSION                (GE_BA+0x044)      /* width/height of X/Y BitBLT */
#define REG_GE_FILTER_DIMENSION         (GE_BA+0x044)      /* shared with CR044 */
#define REG_GE_CLIP_TL                  (GE_BA+0x048)      /* clip top-left */
#define REG_GE_CLIP_BR                  (GE_BA+0x04C)      /* clip bottom-right */
#define REG_GE_PATA                     (GE_BA+0x050)      /* mono pattern 1 */
#define REG_GE_PATB                     (GE_BA+0x054)      /* mono pattern 2 */
#define REG_GE_WRITE_MASK               (GE_BA+0x058)      /* write plane mask */
#define REG_GE_MISC                     (GE_BA+0x05C)      /* misc control */
#define REG_GE_DATA_PORT0               (GE_BA+0x060)      /* HostBLT data port 0x60 ~ 0x7C */
#define REG_GE_DATA_PORT1               (GE_BA+0x064)
#define REG_GE_DATA_PORT2               (GE_BA+0x068)
#define REG_GE_DATA_PORT3               (GE_BA+0x06C)
#define REG_GE_DATA_PORT4               (GE_BA+0x070)
#define REG_GE_DATA_PORT5               (GE_BA+0x074)
#define REG_GE_DATA_PORT6               (GE_BA+0x078)
#define REG_GE_DATA_PORT7               (GE_BA+0x07C) 
 
 
 
/**********************************************************************************************************
 *                                                               
 * 16. Video Processing Engine Control Registers  
 *
 **********************************************************************************************************/
#define REG_VPEEngineTrigger		(VPE_BA+0x00)   /* Video Process Engine Trigger Control Register */
#define REG_VPEDdaFilterCC			(VPE_BA+0x04)   /* DDA 3X3 Filter Central Pixel Tap Coefficient */
#define REG_VPEDdaFilterLU			(VPE_BA+0x08)   /* DDA 3X3 Filter0, Other 4 Coefficients Around Central Pixel */
#define REG_VPEDdaFilterRB			(VPE_BA+0x0C)   /* DDA 3X3 Filter1, Other 4 Coefficients Around Central Pixel */
#define REG_VPEIntStatus			(VPE_BA+0x10)   /* Interrupt Status Register */
#define REG_VPEPacSrcStaAddr		(VPE_BA+0x14)   /* Packet Source Start Address */
#define REG_VPEUVDesSrcPitch		(VPE_BA+0x18)   /* Planar U/V Destination/Source Pitch Register */
#define REG_VPEReset				(VPE_BA+0x1C)   /* Video Process Engine Reset Control Register */
#define REG_VPECommand				(VPE_BA+0x20)   /* Video Process Engine Command Control Register */
#define REG_VPEYSrcStaAddr			(VPE_BA+0x24)   /* Video Process Engine Y Space Planar Start Address */
#define REG_VPEUSrcStaAddr			(VPE_BA+0x28)   /* Video Process Engine U Space Planar Start Address */
#define REG_VPEVSrcStaAddr			(VPE_BA+0x2C)   /* Video Process Engine V Space Planar Start Address */
#define REG_VPEDdaFactor			(VPE_BA+0x30)   /* DDA Vertical and Horizontal Scaling Factor N/M Register */
#define REG_VPEFcPacDesStaAddr		(VPE_BA+0x34)   /* Data Format Conversion Packet Destination Start Address */
#define REG_VPEDesSrcPtich			(VPE_BA+0x38)   /* Video Process Engine Destination/Source Pitch Register */
#define REG_VPEDdaPacDesStaAddr		(VPE_BA+0x3C)   /* DDA Down Scaling Packet Destination Start Address */
#define REG_VPERotRefPacDesStaAddr	(VPE_BA+0x40)   /* Rotate Reference Packet Destination Start Address */
#define REG_VPESrcHW				(VPE_BA+0x44)   /* Video Process Engine Width/Height Dimension Register */
#define REG_VPEDdaYDesStaAddr		(VPE_BA+0x48)   /* DDA Y Pipe Destination Start Address */
#define REG_VPEDdaUDesStaAddr		(VPE_BA+0x4C)   /* DDA U Pipe Destination Start Address */
#define REG_VPEDdaVDesStaAddr		(VPE_BA+0x50)   /* DDA V Pipe Destination Start Address */
#define REG_VPERotRefYDesStaAddr	(VPE_BA+0x54)   /* Rotate Reference Y Pipe Destination Start Address */
#define REG_VPERotRefUDesStaAddr	(VPE_BA+0x58)   /* Rotate Reference U Pipe Destination Start Address */
#define REG_VPERotRefVDesStaAddr	(VPE_BA+0x5C)   /* Rotate Reference V Pipe Destination Start Address */ 
 
 
/**********************************************************************************************************
 *                                                               
 * 17. Motion Estimation Engine Control Registers  
 *
 **********************************************************************************************************/
#define REG_ME_CR			(ME_BA+0x000)    /* ME Control Register */
#define REG_ME_INTCR		(ME_BA+0x004)    /* ME Interrupt Control Register */
#define REG_ME_CADDR		(ME_BA+0x008)    /* Y Component of Current Block Start Address Register */
#define REG_ME_CSTRIDE		(ME_BA+0x00C)    /* Y Component of Current Frame Buffer Stride Register */
#define REG_ME_PADDR		(ME_BA+0x010)    /* Y Component of Previous Block Start Address Register */
#define REG_ME_PSTRIDE		(ME_BA+0x014)    /* Y Component of Previous Frame Buffer Stride Register */
#define REG_ME_MV			(ME_BA+0x018)    /* Motion Vector */
#define REG_ME_MAD			(ME_BA+0x01C)    /* Mean Absolute Difference of Motion Vector */
   
 
/**********************************************************************************************************
 *                                                               
 * 18. High Speed UART Control Registers  
 *
 **********************************************************************************************************/
#define REG_HS_COM_RX     (HSU_BA+0x00)     /* (R) RX buffer */
#define REG_HS_COM_TX     (HSU_BA+0x00)     /* (W) TX buffer */
#define REG_HS_COM_IER    (HSU_BA+0x04)     /* Interrupt enable register */
#define REG_HS_COM_LSB    (HSU_BA+0x00)     /* Divisor latch LSB */
#define REG_HS_COM_MSB    (HSU_BA+0x04)     /* Divisor latch MSB */
#define REG_HS_COM_IIR    (HSU_BA+0x08)     /* (R) Interrupt ident. register */
#define REG_HS_COM_FCR    (HSU_BA+0x08)     /* (W) FIFO control register */
#define REG_HS_COM_LCR    (HSU_BA+0x0C)     /* Line control register */
#define REG_HS_COM_MCR    (HSU_BA+0x10)     /* Modem control register */
#define	REG_HS_COM_LSR    (HSU_BA+0x14)     /* (R) Line status register */
#define	REG_HS_COM_TOR    (HSU_BA+0x1C)     /* Time out register */ 
 
 
/**********************************************************************************************************
 *                                                               
 * 19. UART0 Control Registers  
 *
 **********************************************************************************************************/
#define REG_COM_TX     (UART_BA+0x0)    /* (W) TX buffer */
#define REG_COM_RX     (UART_BA+0x0)    /* (R) RX buffer */
#define REG_COM_LSB    (UART_BA+0x0)    /* Divisor latch LSB */
#define REG_COM_MSB    (UART_BA+0x04)   /* Divisor latch MSB */
#define REG_COM_IER    (UART_BA+0x04)   /* Interrupt enable register */
#define REG_COM_IIR    (UART_BA+0x08)   /* (R) Interrupt ident. register */
#define REG_COM_FCR    (UART_BA+0x08)   /* (W) FIFO control register */
#define REG_COM_LCR    (UART_BA+0x0C)   /* Line control register */
#define REG_COM_MCR    (UART_BA+0x10)   /* Modem control register */
#define	REG_COM_LSR    (UART_BA+0x14)   /* (R) Line status register */
#define REG_COM_MSR    (UART_BA+0x18)   /* (R) Modem status register */
#define	REG_COM_TOR    (UART_BA+0x1C)   /* (R) Time out register */
#define REG_COM_IRCR   (UART2_BA+0x20)   /* (R/W) IrDA control register */
 
/**********************************************************************************************************
 *                                                               
 * 20. Timer Control Registers  
 *
 **********************************************************************************************************/
#define	REG_TCSR0    (TMR_BA+0x0)    /* Control Register 0 */
#define	REG_TCSR1    (TMR_BA+0x04)   /* Control Register 1 */
#define	REG_TICR0    (TMR_BA+0x08)   /* Initial Control Register 0 */
#define	REG_TICR1    (TMR_BA+0x0C)   /* Initial Control Register 1 */
#define	REG_TDR0     (TMR_BA+0x10)   /* Data Register 0 */
#define	REG_TDR1     (TMR_BA+0x14)   /* Data Register 1 */
#define	REG_TISR     (TMR_BA+0x18)   /* Interrupt Status Register */
#define REG_WTCR     (TMR_BA+0x1C)   /* Watchdog Timer Control Register */
#define	REG_TCSR2    (TMR_BA+0x20)   /* Control Register 2 */
#define	REG_TCSR3    (TMR_BA+0x24)   /* Control Register 3 */
#define	REG_TICR2    (TMR_BA+0x28)   /* Initial Control Register 2 */
#define	REG_TICR3    (TMR_BA+0x2C)   /* Initial Control Register 3 */
#define	REG_TDR2     (TMR_BA+0x30)   /* Data Register 2 */
#define	REG_TDR3     (TMR_BA+0x34)   /* Data Register 3 */
#define	REG_TCSR4    (TMR_BA+0x40)   /* Control Register 4 */
#define	REG_TICR4    (TMR_BA+0x48)   /* Initial Control Register 4 */
#define	REG_TDR4     (TMR_BA+0x50)   /* Data Register 2 */

 
/**********************************************************************************************************
 *                                                               
 * 21. Interrupt Control Registers  
 *
 **********************************************************************************************************/
#define REG_AIC_SCR1    (AIC_BA+0x04)    /* Source control register 1 */
#define REG_AIC_SCR2    (AIC_BA+0x08)    /* Source control register 2 */
#define REG_AIC_SCR3    (AIC_BA+0x0C)    /* Source control register 3 */
#define REG_AIC_SCR4    (AIC_BA+0x10)    /* Source control register 4 */
#define REG_AIC_SCR5    (AIC_BA+0x14)    /* Source control register 5 */
#define REG_AIC_SCR6    (AIC_BA+0x18)    /* Source control register 6 */
#define REG_AIC_SCR7    (AIC_BA+0x1C)    /* Source control register 7 */
#define REG_AIC_SCR8    (AIC_BA+0x20)    /* Source control register 8 */
#define REG_AIC_SCR9    (AIC_BA+0x24)    /* Source control register 9 */
#define REG_AIC_SCR10   (AIC_BA+0x28)    /* Source control register 10 */
#define REG_AIC_SCR11   (AIC_BA+0x2C)    /* Source control register 11 */
#define REG_AIC_SCR12   (AIC_BA+0x30)    /* Source control register 12 */
#define REG_AIC_SCR13   (AIC_BA+0x34)    /* Source control register 13 */
#define REG_AIC_SCR14   (AIC_BA+0x38)    /* Source control register 14 */
#define REG_AIC_SCR15   (AIC_BA+0x3C)    /* Source control register 15 */
#define REG_AIC_SCR16   (AIC_BA+0x40)    /* Source control register 16 */
#define REG_AIC_SCR17   (AIC_BA+0x44)    /* Source control register 17 */
#define REG_AIC_SCR18   (AIC_BA+0x48)    /* Source control register 18 */
#define REG_AIC_SCR19   (AIC_BA+0x4C)    /* Source control register 19 */
#define REG_AIC_SCR20   (AIC_BA+0x50)    /* Source control register 20 */
#define REG_AIC_SCR21   (AIC_BA+0x54)    /* Source control register 21 */
#define REG_AIC_SCR22   (AIC_BA+0x58)    /* Source control register 22 */
#define REG_AIC_SCR23   (AIC_BA+0x5C)    /* Source control register 23 */
#define REG_AIC_SCR24   (AIC_BA+0x60)    /* Source control register 24 */
#define REG_AIC_SCR25   (AIC_BA+0x64)    /* Source control register 25 */
#define REG_AIC_SCR26   (AIC_BA+0x68)    /* Source control register 26 */
#define REG_AIC_SCR27   (AIC_BA+0x6C)    /* Source control register 27 */
#define REG_AIC_SCR28   (AIC_BA+0x70)    /* Source control register 28 */
#define REG_AIC_SCR29   (AIC_BA+0x74)    /* Source control register 29 */
#define REG_AIC_SCR30   (AIC_BA+0x78)    /* Source control register 30 */
#define REG_AIC_SCR31   (AIC_BA+0x7C)    /* Source control register 31 */
#define REG_AIC_IRQSC	(AIC_BA+0x80)	 /* External Interrupt Control Register */
#define REG_AIC_GEN		(AIC_BA+0x84)	 /* Interrupt Group Enable Control Register */
#define REG_AIC_GRSR	(AIC_BA+0x88)	 /* Interrupt Group Raw Status Register */
#define REG_AIC_IRSR    (AIC_BA+0x100)   /* Interrupt raw status register */
#define REG_AIC_IASR    (AIC_BA+0x104)   /* Interrupt active status register */
#define REG_AIC_ISR     (AIC_BA+0x108)   /* Interrupt status register */
#define REG_AIC_IPER    (AIC_BA+0x10C)   /* Interrupt priority encoding register */
#define REG_AIC_ISNR    (AIC_BA+0x110)   /* Interrupt source number register */
#define REG_AIC_IMR     (AIC_BA+0x114)   /* Interrupt mask register */
#define REG_AIC_OISR    (AIC_BA+0x118)   /* Output interrupt status register */
#define REG_AIC_MECR    (AIC_BA+0x120)   /* Mask enable command register */
#define REG_AIC_MDCR    (AIC_BA+0x124)   /* Mask disable command register */
#define REG_AIC_SSCR    (AIC_BA+0x128)   /* Source set command register */
#define REG_AIC_SCCR    (AIC_BA+0x12C)   /* Source clear command register */
#define REG_AIC_EOSCR   (AIC_BA+0x130)   /* End of service command register */
#define REG_AIC_TEST    (AIC_BA+0x200)   /* ICE/Debug mode register */

  
/**********************************************************************************************************
 *                                                               
 * 22. Universal Serial Interface Control Registers  
 *
 **********************************************************************************************************/
#define	REG_USI_CNTRL		(USI_BA+0x0)     /* Control and Status Register */
#define	REG_USI_DIVIDER		(USI_BA+0x04)    /* Clock Divider Register */
#define	REG_USI_SSR			(USI_BA+0x08)    /* Slave Select Register */
#define	REG_USI_Rx0			(USI_BA+0x10)    /* Data Receive Register 0 */
#define	REG_USI_Rx1			(USI_BA+0x14)    /* Data Receive Register 1 */
#define	REG_USI_Rx2			(USI_BA+0x18)    /* Data Receive Register 2 */
#define	REG_USI_Rx3			(USI_BA+0x1C)    /* Data Receive Register 3 */
#define	REG_USI_Tx0			(USI_BA+0x10)    /* Data Transmit Register 0 */
#define	REG_USI_Tx1			(USI_BA+0x14)    /* Data Transmit Register 1 */
#define	REG_USI_Tx2			(USI_BA+0x18)    /* Data Transmit Register 2 */
#define	REG_USI_Tx3			(USI_BA+0x1C)    /* Data Transmit Register 3 */
 
 
/**********************************************************************************************************
 *                                                               
 * 23. External Bus Interface Control Registers  
 *
 **********************************************************************************************************/
#define	REG_EBISIZE0	(EBI_BA + 0x00)    /* EBI Bank 0 Size Control Register */
#define	REG_EBISIZE1	(EBI_BA + 0x04)    /* EBI Bank 1 Size Control Register */
#define	REG_EBISIZE2	(EBI_BA + 0x08)    /* EBI Bank 2 Size Control Register */
#define	REG_EBISIZE3	(EBI_BA + 0x0C)    /* EBI Bank 3 Size Control Register */
#define	REG_EBITIM0		(EBI_BA + 0x10)    /* EBI Bank0 Timing Control Register */
#define	REG_EBITIM1		(EBI_BA + 0x14)    /* EBI Bank1 Timing Control Register */ 
#define	REG_EBITIM2		(EBI_BA + 0x18)    /* EBI Bank2 Timing Control Register */ 
#define	REG_EBITIM3		(EBI_BA + 0x1C)    /* EBI Bank3 Timing Control Register */ 

 
#endif /* _NUC900_CPU_H */